using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Recursion_2
{
    class Tasks
    {
        public string[] MenuArray()
        {
            string[] str = {
                "1.Разработать рекурсивный метод, который по заданному натуральному числу N\n" +
                "выведет на экран все натуральные числа не больше N в порядке возрастания.",
                "2.Разработать рекурсивный метод, который по заданному натуральному числу N\n" +
                 "выведет на экран все натуральные числа не больше N в порядке убывания.",
                "3.Разработать рекурсивный метод для вывода на экран стихотворения.",
                "4.Дано натуральное число N. Разработать рекурсивный метод для вывода на экран\n" +
                "следующей последовательности чисел:",
                "5.Дано натуральное число N. Разработать рекурсивный метод для вывода на экран\n" +
                "следующей последовательности чисел:",
                "6.Дано натуральное четное число N. Разработать рекурсивный метод для вывода на экран\n" +
                "следующей картинки:",
                "7.Дано натуральное четное число.Разработать рекурсивный метод для вывода на экран\n" +
                "следующей картинки:",
                "8.Дано натуральное число N. Разработать рекурсивный метод для вывода на экран\n" +
                "следующей картинки:",
                "9.Разработать рекурсивный метод для вывода на экран следующей картинки:",
                "10.Exit"
            };

            return str;
        }
            

        public void Task1(int n)
        {


        }

        public int Task2(int n)
        {

            return 1;

        }

        public void Task3(int n)
        {

        }

        public void Task4(int n)
        {

        }

        public void Task5(int n)
        {       

        }

        public void Task6(int n)
        {          
        }

        public void Task7(int n)
        {

        }

        public void Task8(int n,int z=1)
        {
            
         
        }

        public void Task9(int n = 80, int c = 65)
        {
            
        }
    }
}
